using System;

namespace HW7
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
             * Написать любое приложение, произвести его сборку с помощью MSBuild,
             * осуществить декомпиляцию с помощью dotPeek, 
             * внести правки в программный код и пересобрать приложение. 
             * 
             */
            Console.WriteLine("Hello World!");
            Console.ReadKey();
        }
    }
}
